---
type: BarTypeDiameterOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# BarTypeDiameterOptions

`Autodesk.Revit.DB.BarTypeDiameterOptions` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BarTypeDiameterOptions | — | `` |
| Constructor | BarTypeDiameterOptions | 2018.1 | `public BarTypeDiameterOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | BarModelDiameter | 2018.1 | `public double BarModelDiameter { get ; set ; }` |
| Property | BarNominalDiameter | 2018.1 | `public double BarNominalDiameter { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StandardBendDiameter | 2018.1 | `public double StandardBendDiameter { get ; set ; }` |
| Property | StandardHookBendDiameter | 2018.1 | `public double StandardHookBendDiameter { get ; set ; }` |
| Property | StirrupTieBendDiameter | 2018.1 | `public double StirrupTieBendDiameter { get ; set ; }` |